# # Шпаргалки по типам, классам, функциям

# ТИПЫ
# 5 - тип int (целое число)
# 5.86 - тип float (дробное число)
# Привет - тип str (строка)
# 1 или 0 (True или False) - тип bool (булевое, единица или ноль, правда или ложь)
#
# АРИФМЕТИЧЕСКИЕ ОПЕРАЦИИ
#
# + сложение
# - вычитание
# * умножение
# / деление
# % остаток от деления (проверка на кратность)
# // целочисленное деление
# ** возведение в степень

a = int(input('Enter number:'))
b = int(input('Enter number:'))
c = int(input('Enter number:'))
d = a * 2 * b
print(a + b + c)
